InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ОбластиПрименения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ОбластиПрименения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты/Forms/КПиЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	////Элементы.Список.РежимВыбора=Истина;
	//
	////Если Параметры.Свойство("спКП") Тогда
	////	Эл=Список.Параметры.Элементы.Найти("спКП");
	////	Эл.Значение=Параметры.спКП;
	////	Эл.Использование=Истина;
	////КонецЕсли;
	////
	////Если Параметры.Свойство("ВидЗадачи") Тогда
	////	Эл=Список.Параметры.Элементы.Найти("ВидЗадачи");
	////	Эл.Значение=Параметры.ВидЗадачи;
	////	Эл.Использование=Истина;
	////КонецЕсли;
	//
	//Если Параметры.Свойство("спКП") Тогда
	//	Отбор=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке;
	//	Отбор.Использование=Истина;
	//	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("КП");
	//	Отбор.ПравоеЗначение=Параметры.спКП;
	//КонецЕсли;
	//
	////Если Параметры.Свойство("ВидСобытия") Тогда
	////	ВидСобытия=Параметры.ВидСобытия;
	////	
	////	Парам=Список.Параметры.Элементы.Найти("ВидСобытия");
	////	Парам.Значение=ВидСобытия;
	////	Парам.Использование=Истина;
	////	
	////	//ГруппаИЛИ=Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	////	//ГруппаИЛИ.Использование=Истина;
	////	//ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	////	//
	////	//Отбор=ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	////	//Отбор.Использование=Истина;
	////	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВидЗадачи");
	////	//Отбор.ПравоеЗначение=Параметры.ВидЗадачи;
	////	//
	////	//Отбор=ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////	//Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.НеЗаполнено;
	////	//Отбор.Использование=Истина;
	////	//Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ЗадачаСсылка");
	////КонецЕсли;

	//Парам=Список.Параметры.Элементы.Найти("ВидыСобытий");
	//Парам.Значение=Сп;
	//Парам.Использование=Истина;
	
	Если Параметры.Свойство("спКП") Тогда спКП=Параметры.спКП КонецЕсли;
	Если Параметры.Свойство("ВидСобытия") Тогда ВидСобытия=Параметры.ВидСобытия КонецЕсли;	
	ОбновитьТаблицу();
	
КонецПроцедуры

Процедура ОбновитьТаблицу()
	Запрос=Новый Запрос;
	
	Сп=Новый Массив;
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Кредит);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.Страховка);
	Сп.Добавить(Справочники.CRM_ВидыСобытий.КонсультацияОФУ);
	
	Запрос.УстановитьПараметр("ВидыСобытий",Сп);
	Запрос.УстановитьПараметр("спКП",спКП.ВыгрузитьЗначения());
	
	Запрос.Текст="
	|Выбрать
	|	КП.Ссылка.Дата Дата,
	|	КП.Ссылка.Сумма Сумма,
		
	|	Выбор Когда СоставКП.Конфигурация.Модель=Значение(Справочник.Модели.ПустаяСсылка) Тогда
	|		СоставКП.Конфигурация.Автомобиль.Наименование+"" ""+СоставКП.Конфигурация.Автомобиль.VIN
	|	Иначе
	|		СоставКП.Конфигурация.Наименование+"" ""+СоставКП.Конфигурация.Модель.Наименование+"" ""+СоставКП.Конфигурация.Версия.Наименование
	|	Конец Конфигурация,

	|	ВЫБОР КОГДА ЕСТЬNULL(Воронка.IDK,0)>0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ ОсновноеКП,
	|	КП.Ссылка КП,
		
	|	Задача.Ссылка ЗадачаСсылка,
	|	Задача.ВидСобытия,
	|	Задача.Наименование Задача,
	|	Задача.Исполнитель,
	|	Задача.Сотрудник,
	|	Задача.Состояние
		//Задача.СостояниеЗадачи

	|ИЗ Документ.CRM_КоммерческоеПредложение КП
	|Левое Соединение Документ.CRM_КоммерческоеПредложение.Состав СоставКП
	|По КП.Ссылка=СоставКП.Ссылка

	|Левое Соединение Задача.Renault_События Задача 
	|По КП.Ссылка=Задача.Объект И Не Задача.ПометкаУдаления И Задача.ВидСобытия В(&ВидыСобытий)

	|Левое Соединение РегистрСведений.CRM_ВоронкаПродаж Воронка
	|По КП.Ссылка=Воронка.Объект И Воронка.ЭтапПродаж=Значение(Справочник.CRM_ЭтапыПродаж.КоммерческоеПредложение)

	|ГДЕ СоставКП.НомерСтроки=1 "+?(спКП.Количество()>0,"И КП.Ссылка В(&спКП)","");
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	//ОповеститьОВыборе(ВыбраннаяСтрока);
	//Закрыть(ВыбраннаяСтрока);
	//ВладелецФормы.Выбор_КП(ВыбраннаяСтрока,ВидСобытия);
	
	ТекЗадача=Табл.НайтиПоИдентификатору(ВыбраннаяСтрока).ЗадачаСсылка;
	
	ОбластиПрименения=Новый Массив;
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
	
	Задачи.Renault_События.ОткрытьЗадачу(ТекЗадача,ЭтаФорма,ОбластиПрименения);
КонецПроцедуры

&НаКлиенте
Процедура кнДействияКнопок(Команда)
	ТекЗадача=Элементы.Табл.ТекущиеДанные.ЗадачаСсылка;
	Если Команда.Имя="кнНазначитьИсполнителя" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Сотрудник=Renault_ОбщиеФункции.ПолучитьМенеджераОФУ(ЭтаФорма,ТекЗадача.Сотрудник);
		Если Сотрудник=Неопределено Тогда Возврат КонецЕсли;
		Если Не Задачи.Renault_События.УстановитьАдресацию(ТекЗадача,Сотрудник) Тогда Возврат КонецЕсли;
		
	ИначеЕсли Команда.Имя="кнСоздатьЗадачу" Тогда
		//Если НЕ ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		//может быть задача создана по другому виду события, найдем и переделаем...
		Если Не ТекЗадача.Пустая() И ТекЗадача.ВидСобытия<>ВидСобытия Тогда
			ТекЗадача=Задачи.Renault_События.НайтиЗадачуОФУ(Элементы.Табл.ТекущиеДанные.КП,ВидСобытия); 
		КонецЕсли;	
		Задачи.Renault_События.СоздатьОткрытьЗадачуОФУ(ТекЗадача,Элементы.Табл.ТекущиеДанные.КП,ЭтаФорма,ВидСобытия);
		
	//ИначеЕсли Команда.Имя="кнСостояние" Тогда
	//	Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
	//ИначеЕсли Команда.Имя="кнОбновить" Тогда
		
	ИначеЕсли Команда.Имя="кнУдалитьЗадачу" Тогда
		Если ТекЗадача.Пустая() Тогда Возврат КонецЕсли;
		
		Если Не Задачи.Renault_События.УдалитьЗадачу(ТекЗадача) Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	ОбновитьТаблицу();
КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьОткрытьЗадачу(Задача,КП) // создать новую или открыть существующую задачу (страховки / кредита)
//	//если задача существует - открываем
//	Если НЕ Задача.Пустая() Тогда ОткрытьЗадачу(Задача); Возврат КонецЕсли;
//	
//	//иначе создаем новую
//	Отдел=Renault_ОбщиеФункции.ПолучитьОтделОФУ(ЭтаФорма);
//	Если Не ЗначениеЗаполнено(Отдел) Тогда Возврат КонецЕсли;
//	Если ТипЗнч(Отдел)=Тип("СправочникСсылка.CRM_Отделы") Тогда
//		Задача=Задачи.Renault_События.СоздатьНовую(КП,ВидСобытия,,,,Отдел);
//		ПоказатьОповещениеПользователя("Создана задача КСО",ПолучитьНавигационнуюСсылку(Задача),,БиблиотекаКартинок.Задача);
//	Иначе
//		ПоказатьОповещениеПользователя("Не выбран отдел КСО, задача не создана");
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьЗадачу(Ссылка)
//	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат КонецЕсли;
//	ОбластиПрименения=Новый Массив;
//	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.ОФУ);
//	ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
//	Парам=Новый Структура("Ключ,ОбластиПрименения",Ссылка,ОбластиПрименения);
//	//Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
//	ОткрытьФорму("Задача.Renault_События.ФормаОбъекта",Парам,ЭтаФорма,УникальныйИдентификатор);
//КонецПроцедуры	


&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ВладелецФормы<>Неопределено Тогда
		ВладелецФормы.УправлениеКнопкамиОФУ() 
	КонецЕсли;
	
КонецПроцедуры //перерисовать цвета кнопок
